nickdpz/Reloj-Dinamico/Project_Headers/mc9s08jm16.h
/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC00       :1;                                       /* Security State Code, bit 0 */
    byte SEC01       :1;                                       /* Security State Code, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Mechanism Enable */
  } Bits;
  struct {
    byte grpSEC0 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC00                     _NVOPT.Bits.SEC00
#define NVOPT_SEC01                     _NVOPT.Bits.SEC01
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC0                      _NVOPT.MergedBits.grpSEC0

#define NVOPT_SEC00_MASK                1U
#define NVOPT_SEC01_MASK                2U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC0_MASK                 3U
#define NVOPT_SEC0_BITNUM               0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 13.11.2007 */

/*** FIFO0 - FIFO 0 Data Register; 0x00000081 ***/
typedef union {
  byte Byte;
  struct {
    byte FDATA0      :1;                                       /* 8-bit data read/write port for the FIFO Bit 0 */
    byte FDATA1      :1;                                       /* 8-bit data read/write port for the FIFO Bit 1 */
    byte FDATA2      :1;                                       /* 8-bit data read/write port for the FIFO Bit 2 */
    byte FDATA3      :1;                                       /* 8-bit data read/write port for the FIFO Bit 3 */
    byte FDATA4      :1;                                       /* 8-bit data read/write port for the FIFO Bit 4 */
    byte FDATA5      :1;                                       /* 8-bit data read/write port for the FIFO Bit 5 */
    byte FDATA6      :1;                                       /* 8-bit data read/write port for the FIFO Bit 6 */
    byte FDATA7      :1;                                       /* 8-bit data read/write port for the FIFO Bit 7 */
  } Bits;
} FIFO0STR;
extern volatile FIFO0STR _FIFO0 @0x00000081;
#define FIFO0                           _FIFO0.Byte
#define FIFO0_FDATA0                    _FIFO0.Bits.FDATA0
#define FIFO0_FDATA1                    _FIFO0.Bits.FDATA1
#define FIFO0_FDATA2                    _FIFO0.Bits.FDATA2
#define FIFO0_FDATA3                    _FIFO0.Bits.FDATA3
#define FIFO0_FDATA4                    _FIFO0.Bits.FDATA4
#define FIFO0_FDATA5                    _FIFO0.Bits.FDATA5
#define FIFO0_FDATA6                    _FIFO0.Bits.FDATA6
#define FIFO0_FDATA7                    _FIFO0.Bits.FDATA7

#define FIFO0_FDATA0_MASK               1
#define FIFO0_FDATA1_MASK               2
#define FIFO0_FDATA2_MASK               4
#define FIFO0_FDATA3_MASK               8
#define FIFO0_FDATA4_MASK               16
#define FIFO0_FDATA5_MASK               32
#define FIFO0_FDATA6_MASK               64
#define FIFO0_FDATA7_MASK               128


/*** F0BADDR - FIFO 0 Base Address; 0x00000082 ***/
typedef union {
  byte Byte;
  struct {
    byte REWIND      :1;                                       /* Rewind */
    byte             :1; 
    byte FBASE4      :1;                                       /* FIFO Base Address Bit 4 */
    byte FBASE5      :1;                                       /* FIFO Base Address Bit 5 */
    byte FBASE6      :1;                                       /* FIFO Base Address Bit 6 */
    byte FBASE7      :1;                                       /* FIFO Base Address Bit 7 */
    byte FBASE8      :1;                                       /* FIFO Base Address Bit 8 */
    byte FBASE9      :1;                                       /* FIFO Base Address Bit 9 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpFBASE_4 :6;
  } MergedBits;
} F0BADDRSTR;
extern volatile F0BADDRSTR _F0BADDR @0x00000082;
#define F0BADDR                         _F0BADDR.Byte
#define F0BADDR_REWIND                  _F0BADDR.Bits.REWIND
#define F0BADDR_FBASE4                  _F0BADDR.Bits.FBASE4
#define F0BADDR_FBASE5                  _F0BADDR.Bits.FBASE5
#define F0BADDR_FBASE6                  _F0BADDR.Bits.FBASE6
#define F0BADDR_FBASE7                  _F0BADDR.Bits.FBASE7
#define F0BADDR_FBASE8                  _F0BADDR.Bits.FBASE8
#define F0BADDR_FBASE9                  _F0BADDR.Bits.FBASE9
#define F0BADDR_FBASE_4                 _F0BADDR.MergedBits.grpFBASE_4
#define F0BADDR_FBASE                   F0BADDR_FBASE_4

#define F0BADDR_REWIND_MASK             1
#define F0BADDR_FBASE4_MASK             4
#define F0BADDR_FBASE5_MASK             8
#define F0BADDR_FBASE6_MASK             16
#define F0BADDR_FBASE7_MASK             32
#define F0BADDR_FBASE8_MASK             64
#define F0BADDR_FBASE9_MASK             128
#define F0BADDR_FBASE_4_MASK            252
#define F0BADDR_FBASE_4_BITNUM          2


/*** F0SIZE - FIFO 0 Size; 0x00000083 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FSIZE0      :1;                                       /* FIFO Buffer Size Bit 0 */
    byte FSIZE1      :1;                                       /* FIFO Buffer Size Bit 1 */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpFSIZE :2;
    byte         :1;
  } MergedBits;
} F0SIZESTR;
extern volatile F0SIZESTR _F0SIZE @0x00000083;
#define F0SIZE                          _F0SIZE.Byte
#define F0SIZE_FSIZE0                   _F0SIZE.Bits.FSIZE0
#define F0SIZE_FSIZE1                   _F0SIZE.Bits.FSIZE1
#define F0SIZE_FSIZE                    _F0SIZE.MergedBits.grpFSIZE

#define F0SIZE_FSIZE0_MASK              32
#define F0SIZE_FSIZE1_MASK              64
#define F0SIZE_FSIZE_MASK               96
#define F0SIZE_FSIZE_BITNUM             5


/*** F0CTL - FIFO 0 Control; 0x00000085 ***/
typedef union {
  byte Byte;
  struct {
    byte FIFOEN      :1;                                       /* FIFO Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FIFODIR     :1;                                       /* FIFO Direction */
  } Bits;
} F0CTLSTR;
extern volatile F0CTLSTR _F0CTL @0x00000085;
#define F0CTL                           _F0CTL.Byte
#define F0CTL_FIFOEN                    _F0CTL.Bits.FIFOEN
#define F0CTL_FIFODIR                   _F0CTL.Bits.FIFODIR

#define F0CTL_FIFOEN_MASK               1
#define F0CTL_FIFODIR_MASK              128

/* **** 9.4.2008 16:05:56 */

#define MCGT                             This_symb_has_been_depreciated


/* **** 15.8.2008 8:08:15 */

#define SRS_ILAD                         This_symb_has_been_depreciated
#define SRS_ILAD_MASK                    This_symb_has_been_depreciated


/* **** 6.11.2008 15:30:05 */

#define KBIPE_KBIPE3                     This_symb_has_been_depreciated
#define KBIPE_KBIPE3_MASK                This_symb_has_been_depreciated
#define KBIES_KBEDG3                     This_symb_has_been_depreciated
#define KBIES_KBEDG3_MASK                This_symb_has_been_depreciated
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
